"""
დაწერეთ ფუნქცია სახელად is_palindrome რომელსაც გადაეცემა ერთი არგუმენტი ამ შემთხვევაში ტექსტი ანუ სტრინგი
და ნახავს არის თუ არა ის პალინდრომი. პალინდრომია სტრინგი თუ ის ორივე მხრიდან ერთნაირად იკითხება
ანუ თუ მას შევატრიალებთ მივიღებთ იგივე სიტყვას მაგალითად madam, level, radar და ასე შემდეგ.
თუ სიტყვა პალინდრომია ფუნქციამ უნდა დააბრუნოს True თუ არადა დააბრუნოს False.
caller ფუნქციაში დაწერეთ რომ მომხმარებელმა შემოიყვანოს სტრინგი და შემდეგ გადაეცით ის is_palindrome ფუნქციას და დაბრუნებული შედეგი დაბეჭდეთ

argument:
    level
output:
    True

argument:
    hello
output:
    False

P.S
    ფუნქციის განსაზღვრება ხდება def ის გამოყენებით
    def function_name(argument):
        return something

    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""


def is_palindrome():  # fill arguments
    # write your code here
    pass

