"""
დაწერეთ ფუნქცია accumulate რომელსაც გადაეცემა ლისტი რომელიც შეიცავს ტაპლებს
თქვენ უნდა დააბრუნოთ ლისტი სადაც თითოეული რიცხვი იქნება შესბამისი ტაპლის ჯამი


argument:
    [(1, 2, 6), (2, 3, -6), (3, 4), (2, 2, 2, 2)]
output:
    [9, -1, 7, 8]


argument:
    [(1, 2), (2, 3), (3, 4)]
output:
    [3, 5, 7]

P.S
    ფუნქცია გამოიძახება შეგიძლიათ caller ფუნქციიდან
    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული და გადაეცით 2 არგუმენტი  სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""
# define function accumulate


# call your function and print some examples
def caller():
    # write your code here
    pass


if __name__ == "__main__":
    caller()
