"""
დაწერეთ ფუნქცია join_tuples რომელსაც გადაეცემა ტაპლებისგან შემდგარი ლისტი
და ის გააერთიანებს გვერდით მდგომ ტაპლებს იმ შემთხვევაში თუ მათი პირველი ელემენტები ერთმანეთის ტოლია
შედეგი დაარეთარნეთ


argument:
    [(5, 6), (5, 7), (5, 8), (6, 10), (6, 20), (7, 13)]
output:
    [(5, 6, 7, 8), (6, 10, 20), (7, 13)]

P.S
    ცოტა რთული ამოცანაა ამიტომ თუ ვერ დაწერთ შემდეგ ამოცანაზე გადადით
    ფუნქცია გამოიძახება შეგიძლიათ caller ფუნქციიდან
    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული და გადაეცით 2 არგუმენტი  სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""


def join_tuples():  # fill arguments
    # write your code here
    pass
