"""
დაწერეთ ფუნქცია multiply რომელსაც გადაეცემა ტაპლებისგან შემდგარი ლისტი და მანდ უნდა დააბრუნოს წევრ წევრ გადამრავლებული შედეგი
ანუ ყველა ტაპლის პირველი წევრი გადაამრავლოს ერთმანეთზე ყველა მეორე წევრი ერთმანეთზე და ა.შ
ეს იგივეა რაც მათემატიკაში ვექტორების dot ნამრავლი element wise ანუ წევრ წევრ ნამრავლი


argument:
    (1, 2, 3)
    (3, 5, 2)
    (2, 2, 3)
output:
    (6, 20, 18)

P.S
    ფუნქცია გამოიძახება შეგიძლიათ caller ფუნქციიდან
    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული და გადაეცით 2 არგუმენტი  სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""


def multiply():  # fill arguments
    # write your code here
    pass
