"""
დაწერეთ ფუნქცია is_subset რომელსაც გადაეცემა ორი სეტი მაგალითად set1 და set2 და უნდა შეამოწმონს
არის თუ არა s1 s2-ის ქვესიმრავლე ანუ შეიცავს თუ არა s2 s1-ის ყველა ელემენტს
თუ შეიცავს დააბრუნეთ True თუარადა დააბრუნეთ False


argument:
    set1 = {1, 2, 3}
    set2 = {5, 4, 3, 2, 1}
output:
    True


argument:
    set1 = {1, 2, 3}
    set2 = {5, 4, 1}
output:
    False


P.S
    გაიხსენეთ სეტის ოპერატორები, გაერთიანება და კავშირი და ა.შ
    ფუნქცია გამოიძახება შეგიძლიათ caller ფუნქციიდან
    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული და გადაეცით 2 არგუმენტი  სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""
# define function is_subset


# call your function and print some examples
def caller():
    # write your code here
    pass


if __name__ == "__main__":
    caller()
