"""
დაწერეთ ფუნქცია subtraction რომელსაც გადაეცემა ორი სეტი მაგალითად set1, set2 და მათი სხვაობა უნდა დააბრუნოთ
ანუ ისეთი რიცხვები რომელიც შედის მხოლოდ პირველში და მეორეში არა ანუ - ოპერაოტირი უნდა დაწეროთ რათქმაუნდა - ის გამოყენების გარეშე


argument:
    set1 = {0, 1, 2, 3, 4, 5}
    set2 = {1, 2, 3}
output:
    {0, 4, 5}

P.S
    ფუნქცია გამოიძახება შეგიძლიათ caller ფუნქციიდან
    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული და გადაეცით 2 არგუმენტი  სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""
# define function subtraction


# call your function and print some examples
def caller():
    # write your code here
    pass


if __name__ == "__main__":
    caller()
