"""
დაწერეთ ფუნქცია get_balance რომელსაც გადაეცემა ლისტი რომელიც შეიცავს ტაპლებს
ტაპლებში არის მოცემული გადარიცხვების შესახებ ინფორმაცია
(როდის მოხდა გადარიცხვა, ვინ გადაურიცხა, ვის გადაურიცხეს, რამდენი გადაურიცხეს)
ჩათვალეთ რომ თავიდან ყველას 100 ლარი ჰქონდა პროგრამამ უნდა დაადგინოს გადრიცხვების შემდეგ ვის რამდენი აქვს ბალანსზე
და დააბრუნოს სესაბამისი ლისტი სადაც იქნება ტაპლები მოეცემული მომხმარებლის აიდი და გადარიცხვების შემდეგ დარჩენილი თანხა


argument:
    [("25-Nov-2021", 01001021877, 01003577801, 10),
    ("25-Nov-2021", 01001021877, 01003577801, 20),
    ("03-Dec-2021", 01003577801, 02007783199, 30),
    ("04-Dec-2021", 40057831990, 46001233211, 50)]
output:
    [(01001021877, 70), (01003577801, 100), (02007783199, 130), (40057831990 50), (46001233211, 150)]

P.S
    ცოტა რთული ამოცანაა ამიტომ თუ ვერ დაწერთ შემდეგ ამოცანაზე გადადით
    ფუნქცია გამოიძახება შეგიძლიათ caller ფუნქციიდან
    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული და გადაეცით 2 არგუმენტი  სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""
# define function get_balance


# call your function and print some examples
def caller():
    # write your code here
    pass


if __name__ == "__main__":
    caller()
