"""
დაწერეთ ფუნქცია flatten_only_unique რომელსაც გადაეცემა ლისტი რომელიც შეიცავს ტაპლებს
თქვენ უნდა დააბრუნოთ ლისტი რომელიც შეიცავს ტაპლებიდან ამოღებულ უნიკალურ რიცხვებს


argument:
    [(1,3,4), (1,1,1), (4,5,5)]
output:
    [1, 3, 4, 5]

P.S
    ფუნქცია გამოიძახება შეგიძლიათ caller ფუნქციიდან
    ფუნქციას დაარქვით ზუსტად ის სახელი რაც პირობაშია მოცემული და გადაეცით 2 არგუმენტი  სხვა შემთხვევაში ტესტები არ იმუშავებს

*********************************** წარმატებები ***********************************
"""


def flatten_only_unique():  # fill arguments
    # write your code here
    pass
