"""
დაწერეთ ეგრეთწოდებული ჯეირანი. დაწერეთ პროგრამა სადაც მომხმარებელს შემოაყვანინებთ მის არჩევანს
მაგალითად Rock Paper ან Scissors ასევე კომპიუტერმა გაკეთოს თავისი არჩევანი (რანდომის გამოყენებით)
შემდეგ კი შეამოწმეთ თუ ვინ მოიგებს და დაბეჭდეთ. ყოველი ახალი თამაშის დროს მომხმარებელს კითხეთ სურს თუ არა თამაში კიდევ
თუ არადა დაასრულეთ პროგრამა

input:
    Rock
    დავუშვათ რომ კომპიუტერმა აირჩია Scissors

output:
    you win

P.S
    პრინტები დაწერეთ როგორც გინდათ ეს ამოცანა ტესტებზე არ შემოწმდება ამიტომ ეცადეთ უბრალოდ ლამაზად დაბეჭდოთ

    random.randint(start, stop) start იდან stop შუალედში რანდომ რიცხვს დააბრუნებს

*********************************** წარმატებები ***********************************
"""

import random

CHOICES = ["Rock", "Paper", "Scissors"]


def start():
    # write your code here
    pass
