"""
დაწერეთ კამათლის გაგორების ილუსტრაცია. საჭიროა უბრალოდ რიცხვის დაგენერირება სადაც რიცხვი იქნება 1-6 შუალედში
ყოველი გაგორების წინ მომხმარებელს კითხეთ სურს თუ არა თამაში თუ არა და დაამთავროს პროგრამამ მუშაობა

P.S
    პრინტები დაწერეთ როგორც გინდათ ეს ამოცანა ტესტებზე არ შემოწმდება ამიტომ ეცადეთ უბრალოდ ლამაზად დაბეჭდოთ

    random.randint(start, stop) start იდან stop შუალედში რანდომ რიცხვს დააბრუნებს

*********************************** წარმატებები ***********************************
"""

import random


def start():
    # write your code here
    pass
