"""
დაწერეთ პროგრამა სადაც გაქვთ ლისტი (prices) და ორი რიცხვი (filter_from, filter_to)
თქვენ უნდა დაბეჭდოთ ლისტიდან ყველა ის ელემენტი რომელიც არის მოცემული რიცხვების შუალედში. უნუ უნდა გაფილტროთ ლისტი.
ეს იგივეა რაც თითქმის ყველა საითზე გვხვდება როცა პროდუქტების ჩამონათვალია და ფასით გაფილვტრა გვინდა
ვირჩევთ ორ რიცხვს საიდან სადამდე გვინდა რომ იყოს პროდუქტის ფასი და მხოლოს ასეთ პროდუქტებს გვიჩვენებს.
რიცხვები რომელიც ამ პირობას დააკმაყოფილებს დაბეჭდეთ

input:
    prices = [1, 100, 7, 12, 3, 10, 5, 20, 49, 80]
    filter_from = 10
    filter_to = 50

output:
    12
    20
    49

*********************************** წარმატებები ***********************************
"""

prices = [1, 100, 7, 12, 3, 10, 5, 20, 49, 80]
filter_from = 10
filter_to = 50


def filter_list(prices, filter_from, filter_to):
    # write your code here
    pass


if __name__ == "__main__":
    filter_list(prices, filter_from, filter_to)
