"""
ლისტში მოცემული გვაქვს რიცხვები რომელიც შეიძლება ნებისიერი რამის ანალოგიად წარმოვიდგინოთ
მაგალითად ლისტი შედგება სუპერმარკეტის პროდუქტების ფასებისაგან. დაწერეთ პროგრამა რომელიც იპოვის ყველა პროდუქტის ჯამურ ღირებულებას
პროდუქტები მოცემულია ლისტით სახელად prices და პროგრამამ უნდა დაბეჭდოს ლისტში მოცემული რიცხვების ჯამი

input:
    prices = [1, 100, 7, 12, 3, 10, 5]

output:
    138

P.S
    არ გამოიყენოთ ფუნქცია sum()

*********************************** წარმატებები ***********************************
"""

prices = [1, 100, 7, 12, 3, 10, 5]


def list_sum(prices):
    # write your code here
    pass


if __name__ == "__main__":
    list_sum(prices)

