"""
თქვენ ხართ მაღაზიის წარმომადგენელი და თქვენთან მოდის კლიენტი რომელიც გეუბნებათ რომ ყველაზე ძვირიანი ნივთის შეძენა უნდა
დაწერეთ პროგრამა რომელიც ლისტში, სადაც ინახება ყველა ნივთის ფასი, იპოვის ყველაზე ძვირადღირებულს და დაბეჭდავს მას

input:
    item_prices = [1, 100, 7, 12, 3, 10, 5]

output:
    100

P.S
    არ გამოიყენოთ ფუნქცია max()

*********************************** წარმატებები ***********************************
"""

item_prices = [1, 100, 7, 12, 3, 10, 5]


def find_max_price_in_list(item_prices):
    # write your code here
    pass


if __name__ == "__main__":
    find_max_price_in_list(item_prices)

