"""
დაწერეთ პროგრამა რომელიც ლისტიდან (prices) დაბეჭდავვს ყველაზე მცირე 3 რიცხვს.
ეს რიცხვები შეიძლება იყოს რაიმე პროდუქტის ფასები მაგალითად და გვაინტერესებს ყველაზე იაფიანი 3 პროდუქტის ღირებულება
პირველ რიგში უნდა იპოვოთ 3 რიცხვი რომელიც ყველაზე მცირეა ამ ლისტიდან და შემდეგ დაბეჭდოთ ისინი

input:
    prices = [1, 100,  20, 30, 25, 79]

output:
    1
    20
    25

P.S
    გაიხსენეთ დასორტირება

*********************************** წარმატებები ***********************************
"""

prices = [1, 100,  20, 30, 25, 79]


def smallest_numbers(prices):
    # write your code here
    pass


if __name__ == "__main__":
    smallest_numbers(prices)
