"""
დაწერეთ ეგრეთწოდებული ჩამოხრჩობანა (hangman).
პროცესი შემდეგია პროგრამა შემთხვევითობის პრინციპით ირჩევს რაიმე სიტყვას WORDS ლისტიდან (თუ გნებავთ თქვენი ლისტრი გააკეთეთ სასურველი სიტყვებით)
და მომხამრებელს აძლევს საშუალებას რომ გამოიცნოს. მას შემოყავს ასოები რიგ რიგობით და თუ ეს ასო არის სიტყვაში უნდა შეავსოთ ის და აჩვენოთ
თუ არ არის მაშინ მისი სიცოცხლეების რაოდენობა (LIFE_NUMBER) ერთით შემცირდება და როდესაც ყველა სიცოცხლეს დახარჯავს ის წააგებს თამაშს.
ხოლო თუ მანამდე შეძლო მთლიანი სიტყვის გამოცნობა მაშინ მომხმარებელი მოგებულია. წაგების ან მოგების შემდეგ მომხმარებელს კითხეთ სურს თუ არა კიდევ თამაში,
თუ სურს, თავიდან აირჩიეთ სიტყვა და გააგრძელეთ თამაში თუ არადა პროგრამამ დაასრულოს მუშაობა.
გაითვალისწინეთ რომ შემოყვანილი ასო თუ რამდენიმეჯერ მეორდება სიტყვაში ყველა უნდა შეავსოთ.
ასევე მოხმარებელს უნდა შეეძლოს დაინახოს სიტყვის ზომა და გამოცნობილი ასოები ვიზუალურად როგორც მაგალითშია მოცემული.



input:
    დავუშვათ რომ კომპიუტერმა აირჩია disappear
    m
output:
    _________


input:
    დავუშვათ რომ კომპიუტერმა აირჩია disappear
    a
output:
    ___a___a_


P.S
    პრინტები დაწერეთ როგორც გინდათ ეს ამოცანა ტესტებზე არ შემოწმდება ამიტომ ეცადეთ უბრალოდ ლამაზად დაბეჭდოთ

    random.randint(start, stop) start იდან stop შუალედში რანდომ რიცხვს დააბრუნებს
    გაიხსენეთ რას აკეთებდა join() split() მეთოდები
    გამოიყენეთ ფუნქციები და აუცილებლად დაწერეთ კომენტარები
    

*********************************** წარმატებები ***********************************
"""

import random


LIFE_NUMBER = 3

""" I use list to store all possible words """
WORDS = ["aunt", "strange", "broad", "stale", "craven", "disappear", "wistful", "rustic", "bushes", "splendid",
         "aftermath", "shallow", "demonic", "vessel", "tenuous", "hungry", "possible", "wasteful", "finicky", "bounce"
         "scissors", "spectacular", "adamant", "knotty", "chief", "locket", "telling", "harbor", "stick", "dislike"]


# Define all the functions what you need

def start_game():
    # write your code here
    pass
