"""
დაწერეთ პროგრამა რომელიც იქნება რომელიც მოახერხებს ლარის დოლარში გადაკონვერტირებას და პირიქით ანუ დოლარის ლარში.
მომხმარებელს შემოაყვანინეთ ერთი რიცხვი და ერთი ტექსტი სადაც რიცხვი იქნება რისი გადაკონვერიტრებაც უნდა
ხოლო ტექსტში თუ ეწერება gel ეს ნიშნავსმას სურს ლარში გადაყვანა შესაბამისად შემოყვანილი რიცხვი დოლარში ყოფილა
ხოლო თუ usd წერია ნიშნავს რომ სურს დოლარში გადაყვანა ანუ პირველი რიცხვი ლარში ყოფილა
თუ მომხმარებელმა ტექსტში არც gel და არც usd არ შემოიყვანე დაბეჭდეთ: please enter money type correctly

input:
    13
    gel
output:
    41.6


input:
    15
    usd
output:
    4.6875

P.S:
    დოლარის კურსისთვის გამოიყენეთ უკვე შექმნილი ცვლადი USD

hint:
    გაითვალისწინეთ რომ დოლარის კურსი არ არის მთელი შესაბამისად ნამრავლი ან განაყფი შეიძლება ათწილადი იყოს

*********************************** წარმატებები ***********************************
"""

USD = 3.0


def gel_usd():
    # write your code here
    pass
