"""
ერთ ერთ ქალაქში მგზავრობასთან დაკავშირებით არის შემდეგი კანონი, თუ თქვენ მანქანას ატარებთ 60 მდე სიჩქარით
თქვენ არ ჯარიმდებით თუ თქვენ ატარებთ 61-80 მდე ჯარიმა არის 100 ლარი ხოლო თუ ატარებთ 81 დან 100 მდე ჯარიმა არის 200 ლარი
ხოლო თუ უფრო ჩქარა ატარებთ გიჭერენ და დაბეჭდეთ arrested :)
მაგრამ თუ იმ დღეს იყო თქენი დაბადებისდღე მაშინ პოლიციელი 5-ით გადაჭარბებას გპატიობთ
ანუ თუ თქვენი დაბადებისდღეა 65 მდე შეგიძლიათ ატაროთ 66-85 მდე დაჯარიმბდეით 100 ლარით 86 დან 105 მდე 200 ლარით
დაწერეთ პროგრამა რომელიც დაბეჭდავს თუ რამდენი აირს ჯარიმა მომხმარებელეს შემოაყვანინეთ სიჩქარე და არის თუ არა მისი დაბადებიდღე

input:
    62
    False
output:
    100

input:
    62
    True
output:
    0

P.S
    ჩათვალეთ რომ მხოლოდ დადებითი მთელი რიცხვია სიჩქარე
    input ად შემოყვანილი ყოველთვის არის ტექსტი

*********************************** წარმატებები ***********************************
"""


def driver_speed_test():
    # write your code here
    pass
